Tests/sysbench_results_c7g.2xlarge_20250605_043947.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Thu Jun  5 04:39:47 UTC 2025
Hostname: ip-172-28-34-204.8067.aws-int.thomsonreuters.com
Instance Type: c7g.2xlarge
Operating System: Linux ip-172-28-34-204.8067.aws-int.thomsonreuters.com 6.1.131-143.221.amzn2023.aarch64 #1 SMP Mon Mar 24 15:34:49 UTC 2025 aarch64 aarch64 aarch64 GNU/Linux
CPU Info: AWS Graviton3
CPU Cores: 8
Memory: 15Gi
=====================================================================

[2025-06-05 04:39:47] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-05 04:39:47] Results will be saved to: sysbench_results_c7g.2xlarge_20250605_043947.txt
[2025-06-05 04:39:47] ================================================
[2025-06-05 04:39:47] Checking prerequisites...
[2025-06-05 04:39:47] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-05 04:39:47] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-05 04:39:47] Starting CPU benchmarks...
[2025-06-05 04:39:47] Detected 8 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 04:39:47] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 28489.99 lat (ms,95%): 0.04
[ 20s ] thds: 1 eps: 28512.64 lat (ms,95%): 0.04
[ 30s ] thds: 1 eps: 28502.50 lat (ms,95%): 0.04
[ 40s ] thds: 1 eps: 28507.40 lat (ms,95%): 0.04
[ 50s ] thds: 1 eps: 28551.08 lat (ms,95%): 0.04
[ 60s ] thds: 1 eps: 28545.84 lat (ms,95%): 0.04
[ 70s ] thds: 1 eps: 28507.59 lat (ms,95%): 0.04
[ 80s ] thds: 1 eps: 28509.69 lat (ms,95%): 0.04
[ 90s ] thds: 1 eps: 28503.52 lat (ms,95%): 0.04
[ 100s ] thds: 1 eps: 28525.76 lat (ms,95%): 0.04
[ 110s ] thds: 1 eps: 28550.03 lat (ms,95%): 0.04
CPU speed:
    events per second: 28518.09

Throughput:
    events/s (eps):                      28518.0943
    time elapsed:                        120.0002s
    total number of events:              3422177

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                    0.26
         95th percentile:                        0.04
         sum:                               119619.91

Threads fairness:
    events (avg/stddev):           3422177.0000/0.00
    execution time (avg/stddev):   119.6199/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 04:41:47] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 8 eps: 226291.49 lat (ms,95%): 0.04
[ 20s ] thds: 8 eps: 227021.93 lat (ms,95%): 0.04
[ 30s ] thds: 8 eps: 227213.55 lat (ms,95%): 0.04
[ 40s ] thds: 8 eps: 226743.38 lat (ms,95%): 0.04
[ 50s ] thds: 8 eps: 226934.29 lat (ms,95%): 0.04
[ 60s ] thds: 8 eps: 227026.25 lat (ms,95%): 0.04
[ 70s ] thds: 8 eps: 226987.80 lat (ms,95%): 0.04
[ 80s ] thds: 8 eps: 226314.02 lat (ms,95%): 0.04
[ 90s ] thds: 8 eps: 226988.97 lat (ms,95%): 0.04
[ 100s ] thds: 8 eps: 226929.68 lat (ms,95%): 0.04
[ 110s ] thds: 8 eps: 226887.58 lat (ms,95%): 0.04
CPU speed:
    events per second: 226864.30

Throughput:
    events/s (eps):                      226864.2976
    time elapsed:                        120.0002s
    total number of events:              27223771

Latency (ms):
         min:                                    0.03
         avg:                                    0.04
         max:                                   27.35
         95th percentile:                        0.04
         sum:                               956948.40

Threads fairness:
    events (avg/stddev):           3402971.3750/17822.35
    execution time (avg/stddev):   119.6185/0.00

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-05 04:43:47] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-05 04:43:47] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-05 04:45:40] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 04:45:40] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 6168.61 qps: 98704.80 (r/w/o: 86366.77/0.00/12338.02) lat (ms,95%): 1.42 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 6109.03 qps: 97747.24 (r/w/o: 85529.18/0.00/12218.07) lat (ms,95%): 1.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 6062.50 qps: 96999.27 (r/w/o: 84874.26/0.00/12125.01) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 6016.00 qps: 96254.97 (r/w/o: 84222.97/0.00/12032.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 6059.20 qps: 96947.69 (r/w/o: 84829.29/0.00/12118.40) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 6307.11 qps: 100913.39 (r/w/o: 88299.18/0.00/12614.21) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 6307.40 qps: 100914.35 (r/w/o: 88299.56/0.00/12614.79) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 6300.30 qps: 100807.68 (r/w/o: 88207.08/0.00/12600.60) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 6294.30 qps: 100707.82 (r/w/o: 88119.22/0.00/12588.60) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 6250.80 qps: 100012.77 (r/w/o: 87511.17/0.00/12501.60) lat (ms,95%): 1.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 6285.40 qps: 100569.60 (r/w/o: 87998.80/0.00/12570.80) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 6280.30 qps: 100482.40 (r/w/o: 87921.90/0.00/12560.50) lat (ms,95%): 1.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            10421908
        write:                           0
        other:                           1488844
        total:                           11910752
    transactions:                        744422 (6203.38 per sec.)
    queries:                             11910752 (99254.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      6203.3822
    time elapsed:                        120.0026s
    total number of events:              744422

Latency (ms):
         min:                                    0.78
         avg:                                    1.29
         max:                                   33.38
         95th percentile:                        1.39
         sum:                               959064.69

Threads fairness:
    events (avg/stddev):           93052.7500/1244.78
    execution time (avg/stddev):   119.8831/0.01

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 04:47:40] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1052.00 qps: 6316.02 (r/w/o: 0.00/4211.21/2104.81) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 907.50 qps: 5445.01 (r/w/o: 0.00/3630.01/1815.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 476.00 qps: 2856.00 (r/w/o: 0.00/1904.00/952.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1180.80 qps: 7084.79 (r/w/o: 0.00/4723.19/2361.60) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 262.40 qps: 1574.40 (r/w/o: 0.00/1049.60/524.80) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1159.90 qps: 6959.40 (r/w/o: 0.00/4639.60/2319.80) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 263.60 qps: 1581.60 (r/w/o: 0.00/1054.40/527.20) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1189.60 qps: 7137.59 (r/w/o: 0.00/4758.39/2379.20) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 336.80 qps: 2020.80 (r/w/o: 0.00/1347.20/673.60) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1094.80 qps: 6568.80 (r/w/o: 0.00/4379.20/2189.60) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 429.60 qps: 2577.60 (r/w/o: 0.00/1718.40/859.20) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 1016.60 qps: 6099.58 (r/w/o: 0.00/4066.39/2033.19) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           374820
        other:                           187410
        total:                           562230
    transactions:                        93705  (780.68 per sec.)
    queries:                             562230 (4684.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      780.6777
    time elapsed:                        120.0303s
    total number of events:              93705

Latency (ms):
         min:                                    1.60
         avg:                                   10.24
         max:                                  176.17
         95th percentile:                       37.56
         sum:                               959997.64

Threads fairness:
    events (avg/stddev):           11713.1250/0.60
    execution time (avg/stddev):   119.9997/0.01

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 04:49:40] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 326.67 qps: 6548.60 (r/w/o: 4584.58/1309.88/654.14) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 343.90 qps: 6878.02 (r/w/o: 4814.61/1375.60/687.80) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 262.40 qps: 5248.00 (r/w/o: 3673.60/1049.60/524.80) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 623.00 qps: 12457.59 (r/w/o: 8721.19/2490.40/1246.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 257.20 qps: 5146.40 (r/w/o: 3601.60/1030.40/514.40) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 680.30 qps: 13602.20 (r/w/o: 9521.60/2720.00/1360.60) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 384.00 qps: 7683.80 (r/w/o: 5378.60/1537.20/768.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 347.20 qps: 6944.00 (r/w/o: 4860.80/1388.80/694.40) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 802.50 qps: 16049.99 (r/w/o: 11234.99/3210.00/1605.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 244.90 qps: 4898.00 (r/w/o: 3428.60/979.60/489.80) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 934.00 qps: 18679.94 (r/w/o: 13075.96/3735.99/1867.99) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 237.60 qps: 4752.00 (r/w/o: 3326.40/950.40/475.20) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            762230
        write:                           217780
        other:                           108890
        total:                           1088900
    transactions:                        54445  (453.64 per sec.)
    queries:                             1088900 (9072.86 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      453.6430
    time elapsed:                        120.0173s
    total number of events:              54445

Latency (ms):
         min:                                    2.00
         avg:                                   17.63
         max:                                  242.46
         95th percentile:                       38.94
         sum:                               959992.29

Threads fairness:
    events (avg/stddev):           6805.6250/19.70
    execution time (avg/stddev):   119.9990/0.01

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-05 04:51:40] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1035310
        write:                           0
        other:                           0
        total:                           1035310
    transactions:                        1035310 (103479.12 per sec.)
    queries:                             1035310 (103479.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      103479.1242
    time elapsed:                        10.0050s
    total number of events:              1035310

Latency (ms):
         min:                                    0.02
         avg:                                    0.08
         max:                                   56.33
         95th percentile:                        0.13
         sum:                                79752.50

Threads fairness:
    events (avg/stddev):           129413.7500/2818.20
    execution time (avg/stddev):   9.9691/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-05 04:51:50] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           26761
        other:                           0
        total:                           26761
    transactions:                        26761  (2668.58 per sec.)
    queries:                             26761  (2668.58 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2668.5821
    time elapsed:                        10.0282s
    total number of events:              26761

Latency (ms):
         min:                                    1.10
         avg:                                    2.99
         max:                                   43.71
         95th percentile:                        3.62
         sum:                                80087.66

Threads fairness:
    events (avg/stddev):           3345.1250/0.33
    execution time (avg/stddev):   10.0110/0.01

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-05 04:52:00] Starting K6 benchmarks...
[2025-06-05 04:52:00] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-05 04:52:01] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 12751 complete and 0 interrupted iterations
default   [  13% ] 80 VUs  00m01.0s/10m0s  012751/100000 shared iters

running (00m02.0s), 80/80 VUs, 29127 complete and 0 interrupted iterations
default   [  29% ] 80 VUs  00m02.0s/10m0s  029127/100000 shared iters

running (00m03.0s), 80/80 VUs, 44816 complete and 0 interrupted iterations
default   [  45% ] 80 VUs  00m03.0s/10m0s  044816/100000 shared iters

running (00m04.0s), 80/80 VUs, 60962 complete and 0 interrupted iterations
default   [  61% ] 80 VUs  00m04.0s/10m0s  060964/100000 shared iters

running (00m05.0s), 80/80 VUs, 77298 complete and 0 interrupted iterations
default   [  77% ] 80 VUs  00m05.0s/10m0s  077298/100000 shared iters

running (00m06.0s), 80/80 VUs, 93524 complete and 0 interrupted iterations
default   [  94% ] 80 VUs  00m06.0s/10m0s  093527/100000 shared iters
time="2025-06-05T04:52:07Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=8.28ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  15588.824221/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=4.91ms min=328.7µs  med=4.42ms max=185.69ms p(90)=6.92ms p(95)=8.28ms
      { endpoint:postgres_insert }..............................................: avg=4.91ms min=328.7µs  med=4.42ms max=185.69ms p(90)=6.92ms p(95)=8.28ms
      { expected_response:true }................................................: avg=4.91ms min=328.7µs  med=4.42ms max=185.69ms p(90)=6.92ms p(95)=8.28ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 15588.98011/s

    EXECUTION
    iteration_duration..........................................................: avg=5.08ms min=390.06µs med=4.52ms max=186.93ms p(90)=7.32ms p(95)=8.89ms
    iterations..................................................................: 100000 15588.824221/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.4 MB/s
    data_sent...................................................................: 26 MB  4.1 MB/s



running (00m06.4s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.4s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-05 04:52:07] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T04:52:07Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T04:52:07Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 15711 complete and 0 interrupted iterations
default   [  16% ] 80 VUs  00m00.9s/10m0s  015711/100000 shared iters

running (00m02.0s), 80/80 VUs, 33136 complete and 0 interrupted iterations
default   [  33% ] 80 VUs  00m01.9s/10m0s  033136/100000 shared iters

running (00m03.0s), 80/80 VUs, 50510 complete and 0 interrupted iterations
default   [  51% ] 80 VUs  00m02.9s/10m0s  050510/100000 shared iters

running (00m04.0s), 80/80 VUs, 68042 complete and 0 interrupted iterations
default   [  68% ] 80 VUs  00m03.9s/10m0s  068044/100000 shared iters

running (00m05.0s), 80/80 VUs, 85795 complete and 0 interrupted iterations
default   [  86% ] 80 VUs  00m04.9s/10m0s  085796/100000 shared iters
time="2025-06-05T04:52:13Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T04:52:13Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=7.48ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  51633.470145/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=4.37ms min=270.5µs  med=4.09ms max=22.83ms p(90)=6.41ms p(95)=7.48ms
      { endpoint:postgres_get }.............................................: avg=4.38ms min=270.5µs  med=4.09ms max=22.83ms p(90)=6.42ms p(95)=7.48ms
      { expected_response:true }............................................: avg=4.37ms min=270.5µs  med=4.09ms max=22.83ms p(90)=6.41ms p(95)=7.48ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 17228.539983/s

    EXECUTION
    iteration_duration......................................................: avg=4.57ms min=337.83µs med=4.21ms max=22.91ms p(90)=6.82ms p(95)=8.16ms
    iterations..............................................................: 100000 17211.156715/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.7 MB/s
    data_sent...............................................................: 13 MB  2.2 MB/s



running (00m05.8s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.7s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-05 04:52:13] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 6287 complete and 0 interrupted iterations
default   [   6% ] 80 VUs  00m01.0s/10m0s  006295/100000 shared iters

running (00m02.0s), 80/80 VUs, 17387 complete and 0 interrupted iterations
default   [  17% ] 80 VUs  00m02.0s/10m0s  017387/100000 shared iters

running (00m03.0s), 80/80 VUs, 28549 complete and 0 interrupted iterations
default   [  29% ] 80 VUs  00m03.0s/10m0s  028549/100000 shared iters

running (00m04.0s), 80/80 VUs, 40581 complete and 0 interrupted iterations
default   [  41% ] 80 VUs  00m04.0s/10m0s  040581/100000 shared iters

running (00m05.0s), 80/80 VUs, 54413 complete and 0 interrupted iterations
default   [  54% ] 80 VUs  00m05.0s/10m0s  054413/100000 shared iters

running (00m06.0s), 80/80 VUs, 70297 complete and 0 interrupted iterations
default   [  70% ] 80 VUs  00m06.0s/10m0s  070297/100000 shared iters

running (00m07.0s), 80/80 VUs, 86205 complete and 0 interrupted iterations
default   [  86% ] 80 VUs  00m07.0s/10m0s  086205/100000 shared iters
time="2025-06-05T04:52:21Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=10.39ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  12659.749244/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=6.09ms min=309.26µs med=5.3ms  max=397.24ms p(90)=8.73ms p(95)=10.39ms
      { endpoint:postgres_insert }..............................................: avg=6.09ms min=309.26µs med=5.3ms  max=397.24ms p(90)=8.73ms p(95)=10.39ms
      { expected_response:true }................................................: avg=6.09ms min=309.26µs med=5.3ms  max=397.24ms p(90)=8.73ms p(95)=10.39ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 12659.875841/s

    EXECUTION
    iteration_duration..........................................................: avg=6.26ms min=388.71µs med=5.42ms max=397.66ms p(90)=9.1ms  p(95)=10.84ms
    iterations..................................................................: 100000 12659.749244/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.2 MB/s
    data_sent...................................................................: 26 MB  3.3 MB/s



running (00m07.9s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m07.9s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-05 04:52:21] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T04:52:21Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T04:52:21Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 13394 complete and 0 interrupted iterations
default   [  13% ] 80 VUs  00m00.9s/10m0s  013395/100000 shared iters

running (00m02.0s), 80/80 VUs, 30073 complete and 0 interrupted iterations
default   [  30% ] 80 VUs  00m01.9s/10m0s  030073/100000 shared iters

running (00m03.0s), 80/80 VUs, 46862 complete and 0 interrupted iterations
default   [  47% ] 80 VUs  00m02.9s/10m0s  046862/100000 shared iters

running (00m04.0s), 80/80 VUs, 64050 complete and 0 interrupted iterations
default   [  64% ] 80 VUs  00m03.9s/10m0s  064050/100000 shared iters

running (00m05.0s), 80/80 VUs, 80934 complete and 0 interrupted iterations
default   [  81% ] 80 VUs  00m04.9s/10m0s  080934/100000 shared iters

running (00m06.0s), 80/80 VUs, 97669 complete and 0 interrupted iterations
default   [  98% ] 80 VUs  00m05.9s/10m0s  097669/100000 shared iters
time="2025-06-05T04:52:27Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T04:52:27Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=8.01ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  48854.513299/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=4.65ms min=303.83µs med=4.34ms max=41.32ms p(90)=6.82ms p(95)=8.01ms
      { endpoint:postgres_get }.............................................: avg=4.66ms min=303.83µs med=4.34ms max=41.32ms p(90)=6.82ms p(95)=8.01ms
      { expected_response:true }............................................: avg=4.65ms min=303.83µs med=4.34ms max=41.32ms p(90)=6.82ms p(95)=8.01ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 16301.285453/s

    EXECUTION
    iteration_duration......................................................: avg=4.84ms min=377.81µs med=4.46ms max=42.77ms p(90)=7.21ms p(95)=8.56ms
    iterations..............................................................: 100000 16284.837766/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.5 MB/s
    data_sent...............................................................: 13 MB  2.1 MB/s



running (00m06.1s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-05 04:52:27] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Thu Jun  5 04:52:28 UTC 2025
Duration: 12 minutes and 41 seconds
Results saved to: sysbench_results_c7g.2xlarge_20250605_043947.txt
=====================================================================
[2025-06-05 04:52:28] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-05 04:52:28] Detailed results saved to: sysbench_results_c7g.2xlarge_20250605_043947.txt